bn = input().strip()
decimal = int(bn, 2)
print(hex(decimal)[2:].upper())

# Программа получает на вход строку, состоящую из нулей и единиц, длина которой не превосходит 1000 символов. Первый символ строки всегда единица. Данная строка является двоичной записью некоторого числа, которое необходимо записать в шестнадцатеричном виде и вывести с использованием цифр 0, ..., 9 и букв A, ..., F без лидирующих нулей.

# Выходные данные
# Выведите результат перевода.

# Примеры
# Входные данные
# 101
# Выходные данные
# 5