x = int(input()) 
n = int(input())  

table = [list(map(int, input().split())) for _ in range(n)]

for col in 
# if x in table:
#     print('YES')
# else:
#     print('NO')

# Входные данные
# В первой строке число X, не превышающее по модулю 2*109. 
# Во второй строке число N (1 <= N <= 100), В следующих N строках 
# по N целых чисел, не превышающих по модулю 2*109 – числа в ячейках таблицы.

# Выходные данные
# Для каждого столбца выведите YES, если в нем есть число Х, и NO в противном случае. (Каждый ответ с новой строки)

# Примеры
# входные данные
# 1789
# 1
# 1789
# выходные данные
# YES