# никнеймы есть в его секретном списке. 
# К слову, вот этот список: Мавпродош, Лорнектиф, Древерол, Фиригарпиг, Клодобродыч. 
# По мере увеличения круга знакомых Максим, естественно, дополнит данный список.
# Ваша задача такова: создайте, который будет спрашивать у пользователя его ник и 
# либо пускать на сайт (выведется сообщение «Ты – свой. Приветствую, любезный {НИК_ПОСЕТИТЕЛЯ}!»), 
# либо нет (в этом случае будет такой текст: «Тут ничего нет. Еще есть вопросы?». 
# Для проверки прозвищ посетителей используйте встроенную функцию input().
